# Shell & System Core
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "htop"
brew "wget"
brew "zsh"
brew "gnupg"
brew "pinentry-mac"
brew "less"

# Terminal Prompt & Navigation
brew "eza"
brew "fzf"
brew "starship"
brew "zoxide"

# Text Processing & Code Search
brew "difftastic"
brew "git-delta"
brew "jq"
brew "micro"
brew "rename"
brew "ripgrep"
brew "neovim"
brew "thefuck"

# Version Control
brew "gh"
brew "git"
brew "lazygit"

# Programming Languages & Runtimes
brew "go"
brew "node"
brew "openjdk"
brew "python"
brew "jenv"

# Cloud & Kubernetes DevOps
brew "helm"
brew "helm-docs"
brew "helmfile"
brew "kubectl"
brew "kubectx"
cask "gcloud-cli"

# Database CLIs
brew "mongocli"
brew "postgresql"

# AI & LLM Tools
cask "claude-code"

# Fonts
cask "font-sauce-code-pro-nerd-font"

# Terminals & IDEs
cask "intellij-idea"
cask "iterm2"
cask "visual-studio-code"

# Database Clients (GUI)
cask "another-redis-desktop-manager"
cask "mongodb-compass"
cask "pgadmin4"

# Containers & API Development (GUI)
cask "postman"
cask "rancher"

# Web Browsers
cask "firefox"
